LaureanoOlocco/RTOS-Lab/Demo/CORTEX_LM3S811_GCC/main.c
/* FreeRTOS includes. */
#include "FreeRTOS.h"
#include "task.h"
#include "queue.h"
#include "semphr.h"

#include <string.h>

/* Environment includes. */
#include "DriverLib.h"

/*====================== UART & Timer ========================*/
#define mainBAUD_RATE               115200     // Baud rate for serial communication
#define TIMER_LOAD_VALUE            1500       // Initial load value for the timer

/*====================== Booleans ========================*/
#define TRUE                        1          // Boolean value for true

/*====================== Timing Delays ========================*/
#define DELAY_10_MS                 10         // Delay of 10 milliseconds
#define DELAY_100_MS                100        // Delay of 100 milliseconds
#define DELAY_5_SECONDS             5000       // Delay of 5 seconds

/*====================== Buffer Sizes ========================*/
#define BUFFER_SIZE                 50         // General string formatting buffer
#define BUFFER_SIZE_STATS           128        // For task statistics output
#define BUFFER_SIZE_TEMP            16         // Temporary string formatting
#define INPUT_BUFFER_SIZE           10         // UART input buffer

/*====================== Temperature Data ========================*/
#define MIN_TEMPERATURE             15         // Minimum temperature (°C)
#define TEMPERATURE_RANGE           20         // Expected range (35 - 15 °C)
#define MAX_HEIGHT                  15         // Max height for temperature graph

/*====================== Display Config ========================*/
#define DISPLAY_BUFFER_OFFSET       96         // Number of display columns
#define IMAGE_HEIGHT_PAGES          2          // Display height in pages (8px per page)
#define IMAGE_X_START               4          // X coordinate for drawing image
#define IMAGE_Y_START               4          // Y coordinate for drawing image
#define Y_AXIS_HEIGHT               16         // Height of the Y axis
#define X_AXIS_POSITION             15         // Row for X axis (bottom row)
#define PIXEL_ON                    1          // Pixel ON state

/*====================== PRNG Settings ========================*/
#define MULTIPLIER                  1103515245 // LCG multiplier
#define INCREMENT                   12345      // LCG increment
#define SHIFT_BITS                  16         // Bits to shift result
#define RESULT_MASK                 0x7FFF      // Mask for 15-bit output
#define BASE_DECIMAL                10         // Decimal base for number conversion

/*====================== Queue Config ========================*/
#define QUEUE_LENGTH                10         // Queue length for temperature values

/*====================== Filter Parameters ========================*/
#define MAX_WINDOW_SIZE             10         // Max filter window size
#define MIN_WINDOW_SIZE             2          // Min filter window size

/*====================== FreeRTOS Stack Sizes ========================*/
#define STACK_SIZE_TEMP_SENSOR      96         // Stack for temperature task
#define STACK_SIZE_FILTER           96         // Stack for filtering task
#define STACK_SIZE_GRAPH            96         // Stack for graph task
#define STACK_SIZE_UART_READER      96         // Stack for UART command task
#define STACK_SIZE_MONITOR_STACK    64         // Stack for monitoring task

/* Global variables */
QueueHandle_t xRawTemperatureQueue;
QueueHandle_t xFilteredDataQueue;
unsigned long ulHighFrequencyTimerTicks;

TaskHandle_t xTempSensorHandle = NULL;
TaskHandle_t xFilterHandle = NULL;
TaskHandle_t xGraphHandle = NULL;
TaskHandle_t xUARTReaderHandle = NULL;
unsigned char ucDisplayBuffer[96 * 2] = {0}; // 96 columns, 2 pages (16px height)
volatile int filter_window_size = 5;        // Window size (last N samples)

/* Function prototypes */
void Timer0IntHandler( void );
void prvSetupTimer( void );
void vUARTSetup(void);
unsigned long ulGetHighFrequencyTimerTicks( void );
void vUARTSend(const char *string);
void formatString(char *buffer, const char *prefix, int value, const char *suffix);
void setPixel(int x, int y, int on);
int pseudorandom(void);
int stringToInt(const char *str);
void formatTaskStats(char *buffer, TaskStatus_t *task, uint32_t totalRunTime);
char *utoa(unsigned int value, char *str, int base);

/* Task prototypes */
void vSimulateTemperatureSensorTask(void *pvParameters);
void vLowPassFilterTask(void *pvParameters);
void vDisplayGraphTask(void *pvParameters);
void vUARTReaderTask(void *pvParameters);
void vMonitorStackTask(void *pvParameters);
void vTopLikeTask(void *pvParameters);

/**
 * @brief Handles stack overflow detection in FreeRTOS tasks.
 *
 * This function is called automatically when FreeRTOS detects a stack overflow 
 * in any task. It sends a status character via UART and enters an infinite loop 
 * to halt execution, preventing further issues caused by the overflow.
 *
 * @param xTask Handle to the task that experienced the stack overflow.
 * @param pcTaskName Pointer to the name of the task that overflowed (null-terminated string).
 */
void vApplicationStackOverflowHook(TaskHandle_t xTask, char *pcTaskName) {
    UARTCharNonBlockingPut(UART0_BASE, 'S');
    while (TRUE);
}

void vUART_ISR(void)
{}

/**
 * @brief Configures and initializes Timer0 for a 32-bit periodic timer.
 *
 * This function sets up Timer0 by enabling the required peripheral, enabling
 * interrupts, configuring the timer in 32-bit mode, loading the initial timer
 * value, registering the interrupt handler, and enabling the timer. The timer
 * is configured to trigger an interrupt upon timeout.
 *
 * @note Ensure that the `Timer0IntHandler` function is implemented to handle
 * the timer interrupts properly.
 */
void prvSetupTimer( void )
{
	SysCtlPeripheralEnable(SYSCTL_PERIPH_TIMER0);
	IntMasterEnable();
	TimerIntEnable(TIMER0_BASE, TIMER_TIMA_TIMEOUT);
	TimerConfigure(TIMER0_BASE,TIMER_CFG_32_BIT_TIMER);
	TimerLoadSet(TIMER0_BASE, TIMER_A, TIMER_LOAD_VALUE);
	TimerIntRegister(TIMER0_BASE,TIMER_A, Timer0IntHandler);
	TimerEnable(TIMER0_BASE,TIMER_A);
}

/**
 * @brief Retrieves the current high-frequency timer tick count.
 *
 * This function returns the value of the `ulHighFrequencyTimerTicks` variable,
 * which represents the number of ticks counted by the high-frequency timer.
 *
 * @return The current high-frequency timer tick count as an unsigned long.
 */
unsigned long ulGetHighFrequencyTimerTicks(void)
{
	return ulHighFrequencyTimerTicks;
}

int main(void)
{
    vUARTSetup();  // Configures UART and enables interrupts.

//  Creamos la cola para enviar datos de temperatura sin filtrar
    xRawTemperatureQueue = xQueueCreate(QUEUE_LENGTH, sizeof(int));

