LaureanoOlocco/RTOS-Lab/Demo/CORTEX_LM3S811_GCC/main.c
    if (xRawTemperatureQueue == NULL) {
        //  Si la cola no pudo crearse (posible falta de memoria), lo informamos por UART
        vUARTSend("Error: Failed to create raw temperature queue.\n");

    //Entramos en bucle infinito porque el sistema no puede continuar sin esta cola
        for (;;);
    }

    // Queue to pass filtered values
    xFilteredDataQueue = xQueueCreate(QUEUE_LENGTH, sizeof(int));
    if (xFilteredDataQueue == NULL) {
        vUARTSend("Error: Could not create queue for filtered values.\n");
        for (;;);
    }

    vUARTSend("Starting...\n");

    OSRAMInit(TRUE);  // Initializes the display with fast speed (400 kbps)
    OSRAMDisplayOn(); // Turn on the display

    xTaskCreate(vSimulateTemperatureSensorTask, "TempSensorTask", STACK_SIZE_TEMP_SENSOR, NULL, tskIDLE_PRIORITY + 1, NULL);
    xTaskCreate(vLowPassFilterTask, "FilterTask", STACK_SIZE_FILTER, NULL, tskIDLE_PRIORITY + 2, NULL);
    xTaskCreate(vDisplayGraphTask, "GraphTask", STACK_SIZE_GRAPH, NULL, tskIDLE_PRIORITY + 3, NULL);
    BaseType_t result = xTaskCreate(vUARTReaderTask, "UARTReader", STACK_SIZE_UART_READER, NULL, tskIDLE_PRIORITY + 4, NULL);
    if (result != pdPASS) {
        vUARTSend("❌ UARTReaderTask couldn't be created.\n");
    }
    xTaskCreate(vMonitorStackTask, "MonitorStack", STACK_SIZE_MONITOR_STACK, NULL, tskIDLE_PRIORITY + 1, NULL);
    xTaskCreate(vTopLikeTask, "TopTask", configMINIMAL_STACK_SIZE, NULL, tskIDLE_PRIORITY + 1, NULL);

    vTaskStartScheduler();

    // Should never reach this point
    for(;;);

    return 0;
}

/* ------------------------------------- Tasks --------------------------------------------- */

/**
 * @brief Simulates a temperature sensor task
 *
 * This task generates pseudo-random temperature values between 15 and 35 degrees Celsius. 
 * The task runs continuously in an infinite loop. 
 * It operates at a frequency of 10 Hz (every 100 milliseconds).
 *
 * @param pvParameters Pointer to task-specific parameters (not used in this implementation).
 *                     Included to satisfy the task function prototype requirements.
 */
void vSimulateTemperatureSensorTask(void *pvParameters)
{
    (void)pvParameters; // Avoid compiler warnings for unused parameter

    while (TRUE)
    {
        int temperature = MIN_TEMPERATURE + (pseudorandom() % (TEMPERATURE_RANGE + 1));  // Between 15 and 35 degrees Celsius

        char buffer[BUFFER_SIZE];

        if (xQueueSend(xRawTemperatureQueue, &temperature, portMAX_DELAY) != pdPASS) {
            vUARTSend("Error: temperature read couldn't be sent through the queue\n");
        }

        // Delay task to achieve a frequency of 10 Hz (100 ms)
        vTaskDelay(pdMS_TO_TICKS(DELAY_100_MS));
    }
}

/**
 * @brief FreeRTOS task that applies a moving average (low-pass) filter
 *        to raw temperature readings and outputs filtered values.
 *
 * This task continuously receives temperature readings from a queue,
 * maintains a circular buffer of the most recent N samples,
 * and computes the average (filtered value) to reduce noise.
 * The window size N can be changed dynamically (e.g., via UART).
 *
 * @param pvParameters Unused (required by FreeRTOS task signature).
 */
void vLowPassFilterTask(void *pvParameters)
{
    (void)pvParameters;  // Avoid unused parameter warning

    // Copy initial window size from global variable
    int window_size = filter_window_size;

    // Allocate memory for circular buffer (max size)
    int *buffer = pvPortMalloc(MAX_WINDOW_SIZE * sizeof(int));
    if (buffer == NULL) {
        vUARTSend("Error: could not allocate memory for filter buffer.\n");
        vTaskSuspend(NULL); // Suspend this task
    }

    int index = 0;   // Current write position in circular buffer
    int sum = 0;     // Accumulated sum of values in window
    int count = 0;   // Actual number of valid samples used in the average

    while (TRUE)
    {
        int new_window_size = filter_window_size;

        // If user changed filter size (e.g., via UART), reset buffer and counters
        if (new_window_size != window_size) {
            window_size = new_window_size;
            index = 0;
            sum = 0;
            count = 0;
            memset(buffer, 0, MAX_WINDOW_SIZE * sizeof(int));
            vUARTSend("\nFilter window size updated.\n");
        }

        int raw_temperature;

        // Wait for next raw temperature reading from queue
        if (xQueueReceive(xRawTemperatureQueue, &raw_temperature, portMAX_DELAY) == pdPASS) {

            // Subtract old value at current position from sum
            sum -= buffer[index];

            // Store new value in buffer and update sum
            buffer[index] = raw_temperature;
            sum += raw_temperature;

            // Move to next position (circularly)
            index = (index + 1) % window_size;

            // Update count if buffer is not yet full
            if (count < window_size) {
                count++;
            }

            // Compute filtered average value
            int filtered_value = sum / count;

            // Send filtered result to next processing stage
            if (xQueueSend(xFilteredDataQueue, &filtered_value, portMAX_DELAY) != pdPASS) {
                vUARTSend("\nError: failed to send filtered value to queue.\n");
            }
        }
    }
}
/**
 * @brief Task to render a real-time temperature graph on the display.
 *
 * This task listens to the filtered temperature data queue, maps the values
 * to a displayable height range, and updates a scrolling graph. It also
 * draws reference axes and overlays the current temperature as text.
 *
 * @param pvParameters Unused parameter, required by FreeRTOS task signature.
 */
void vDisplayGraphTask(void *pvParameters)
{
    (void)pvParameters;
    int graphIndex = 0;
    char buffer[BUFFER_SIZE];

    while (TRUE)
    {
        int value;
        if (xQueueReceive(xFilteredDataQueue, &value, portMAX_DELAY) == pdPASS)
        {
            // We scale the value from 15-35°C to a range of 0-15 (display height)
            int y = (value - MIN_TEMPERATURE) * MAX_HEIGHT / TEMPERATURE_RANGE;
            if (y < 0) y = 0;
            if (y > MAX_HEIGHT) y = MAX_HEIGHT;

            // Shift buffer to the left
            for (int i = 0; i < DISPLAY_BUFFER_OFFSET - 1; i++) {
                ucDisplayBuffer[i] = ucDisplayBuffer[i + 1];
                ucDisplayBuffer[i + DISPLAY_BUFFER_OFFSET] = ucDisplayBuffer[i + 1 + DISPLAY_BUFFER_OFFSET];
            }

