LaureanoOlocco/RTOS-Lab/Demo/CORTEX_LM3S811_GCC/main.c
            // Clear last column
            ucDisplayBuffer[DISPLAY_BUFFER_OFFSET - 1] = 0;
            ucDisplayBuffer[(DISPLAY_BUFFER_OFFSET - 1) + DISPLAY_BUFFER_OFFSET] = 0;

            // Set the new value in the last column
            setPixel(DISPLAY_BUFFER_OFFSET - 1, MAX_HEIGHT - y, PIXEL_ON); // Inverted because the Y axis starts at the top.

            // Draw Y axis (column 0)
            for (int i = 0; i < Y_AXIS_HEIGHT; i++) {
                setPixel(0, i, PIXEL_ON);
            }

            // Draw X axis (bottom row)
            for (int i = 0; i < DISPLAY_BUFFER_OFFSET; i++) {
                setPixel(i, X_AXIS_POSITION, PIXEL_ON);
            }

            OSRAMClear();
            OSRAMImageDraw(ucDisplayBuffer, IMAGE_X_START, IMAGE_Y_START, DISPLAY_BUFFER_OFFSET,IMAGE_HEIGHT_PAGES);

            // Show the numeric value above the graph
            formatString(buffer, "T: ", value, "C");
            OSRAMStringDraw(buffer, IMAGE_X_START, IMAGE_Y_START);
        }
        vTaskDelay(pdMS_TO_TICKS(DELAY_100_MS));
    }
}
/**
 * @brief Task for reading and processing UART input.
 *
 * This FreeRTOS task continuously monitors the UART interface, receiving 
 * and processing incoming characters. It supports numeric input for configuring 
 * a filter window size, provides user feedback via UART, and handles invalid input gracefully.
 *
 * @param pvParameters Pointer to task-specific parameters (unused in this implementation).
 */
void vUARTReaderTask(void *pvParameters) {
    (void)pvParameters;

    char c;
    char inputBuffer[INPUT_BUFFER_SIZE];
    int inputIndex = 0;

    for (;;) {
        if (UARTCharsAvail(UART0_BASE)) {
            c = UARTCharGet(UART0_BASE);  // Reads an available character (blocks if none, but we already checked with UARTCharsAvail)
            UARTCharPut(UART0_BASE, c);   // Direct echo to UART

            if (c >= '0' && c <= '9') {
                if (inputIndex < sizeof(inputBuffer) - 1) {
                    inputBuffer[inputIndex++] = c;
                } else {
                    inputIndex = 0;
                    vUARTSend("\n❗ Very long entry. Try again.\r\n");
                }
            } else if (c == '\r' || c == '\n') {
                vUARTSend("\r\n");
                inputBuffer[inputIndex] = '\0';

                if (inputIndex > 0) {
                    int newN = stringToInt(inputBuffer);
                    if (newN >= MIN_WINDOW_SIZE && newN <= MAX_WINDOW_SIZE) {
                        filter_window_size = newN;
                        vUARTSend("\n✅ Filter now N = ");
                        vUARTSend(inputBuffer);
                        vUARTSend("\r\n");
                    } else {
                        vUARTSend("\n❗ Invalid N (2-10).\r\n");
                    }
                } else {
                    vUARTSend("\n⚠️ Empty buffer.\r\n");
                }
                inputIndex = 0;
            } else {
                inputIndex = 0;
                vUARTSend("\n❗ Non numeric character.\r\n");
            }
        } else {
            vTaskDelay(pdMS_TO_TICKS(DELAY_10_MS));  // Avoid saturating the CPU if there is no data
        }
    }
}

/**
 * @brief Monitors the stack usage of various FreeRTOS tasks.
 *
 * This FreeRTOS task periodically retrieves and reports the stack high water mark 
 * for multiple tasks, providing insights into stack consumption and potential overflow risks.
 *
 * @param pvParameters Pointer to task-specific parameters (unused in this implementation).
 */
void vMonitorStackTask(void *pvParameters)
{
    (void)pvParameters;
    char buffer[BUFFER_SIZE];

    while (TRUE)
    {
        UBaseType_t stackTemp = uxTaskGetStackHighWaterMark(xTempSensorHandle);
        UBaseType_t stackFilter = uxTaskGetStackHighWaterMark(xFilterHandle);
        UBaseType_t stackGraph = uxTaskGetStackHighWaterMark(xGraphHandle);
        UBaseType_t stackUART = uxTaskGetStackHighWaterMark(xUARTReaderHandle);

        vUARTSend("\n📊 Stack High Water Marks:\n");

        formatString(buffer, "TempSensor HWM: ", stackTemp, "\n");
        vUARTSend(buffer);

        formatString(buffer, "FilterTask HWM: ", stackFilter, "\n");
        vUARTSend(buffer);

        formatString(buffer, "GraphTask HWM: ", stackGraph, "\n");
        vUARTSend(buffer);

        formatString(buffer, "UARTReader HWM: ", stackUART, "\n");
        vUARTSend(buffer);

        vTaskDelay(pdMS_TO_TICKS(DELAY_5_SECONDS)); // every 5 seconds
    }
}

/**
 * @brief Monitors system tasks, tracks free heap space, and logs task statistics.
 *
 * This task periodically retrieves system task statuses, monitors heap usage,
 * and reports statistics via UART. If the number of tasks increases, it dynamically
 * resizes the task status array.
 *
 * @param pvParameters Unused parameter, maintained for FreeRTOS compliance.
 */
void vTopLikeTask(void *pvParameters)
{
    TaskStatus_t *pxTaskStatusArray;
    static UBaseType_t uxMaxTasks = 0;

    UBaseType_t uxArraySize, x;
    uint32_t ulTotalRunTime;
    char buffer[BUFFER_SIZE_STATS];  

    while (TRUE)
    {
        uxArraySize = uxTaskGetNumberOfTasks();

        utoa(xPortGetFreeHeapSize(), buffer, BASE_DECIMAL);
        vUARTSend("\n📉 Free Heap: ");
        vUARTSend(buffer);
        vUARTSend("\n");

        if (uxArraySize > uxMaxTasks)
        {
            // Resize only if there are more tasks than before
            if (pxTaskStatusArray != NULL)
                vPortFree(pxTaskStatusArray);

            pxTaskStatusArray = pvPortMalloc(uxArraySize * sizeof(TaskStatus_t));

            if (pxTaskStatusArray != NULL)
                uxMaxTasks = uxArraySize;
            else
            {
                vUARTSend("❌ Could not allocate memory for pxTaskStatusArray\n");
                vTaskDelay(pdMS_TO_TICKS(DELAY_5_SECONDS));
                continue;
            }
        }

        uxArraySize = uxTaskGetSystemState(pxTaskStatusArray, uxArraySize, &ulTotalRunTime);

        vUARTSend("\n🔍 Task Stats:\n");

        for (x = 0; x < uxArraySize; x++)
        {
            formatTaskStats(buffer, &pxTaskStatusArray[x], ulTotalRunTime);
            vUARTSend(buffer);
        }

        vTaskDelay(pdMS_TO_TICKS(DELAY_5_SECONDS));
    }
}

