LaureanoOlocco/RTOS-Lab/Demo/CORTEX_LM3S811_GCC/main.c
/* ------------------------------------- Functions --------------------------------------------- */

/**
 * @brief Interrupt handler for Timer0 time-out event.
 *
 * This function is triggered when Timer0 reaches its time-out condition.
 * It clears the interrupt flag for Timer0 and increments the 
 * `ulHighFrequencyTimerTicks` counter, which tracks high-frequency timer ticks.
 */
void Timer0IntHandler( void )
{
	TimerIntClear(TIMER0_BASE, TIMER_TIMA_TIMEOUT);
	ulHighFrequencyTimerTicks++;
}

/**
 * @brief Configures and initializes UART0 for communication.
 *
 * This function enables the UART0 peripheral, sets its configuration parameters
 * (baud rate, word length, stop bits, and parity), enables UART interrupts, and 
 * sets the interrupt priority. It also globally enables the UART0 interrupt to 
 * ensure proper operation.
 */
void vUARTSetup(void)
{
    IntMasterEnable();
    SysCtlPeripheralEnable(SYSCTL_PERIPH_UART0);
    SysCtlPeripheralEnable(SYSCTL_PERIPH_GPIOA);
    
    GPIOPinTypeUART(GPIO_PORTA_BASE, GPIO_PIN_0 | GPIO_PIN_1);

    UARTConfigSet(UART0_BASE, mainBAUD_RATE, (UART_CONFIG_WLEN_8 | UART_CONFIG_STOP_ONE | UART_CONFIG_PAR_NONE));
    UARTIntDisable(UART0_BASE, UART_INT_RX | UART_INT_RT);
    UARTIntClear(UART0_BASE, UART_INT_RX | UART_INT_RT);
    UARTEnable(UART0_BASE);
}

/**
 * @brief Sends a null-terminated string via UART0.
 *
 * This function transmits a string character by character using UART0. It
 * loops through each character of the provided null-terminated string and
 * sends it until the string is fully transmitted.
 *
 * @param string Pointer to the null-terminated string to be sent.
 */
void vUARTSend(const char *string) {
    while (*string) {
        UARTCharPut(UART0_BASE, *string++);
    }
}

/**
 * @brief Formats a string combining prefix, integer value, and suffix.
 *
 * Converts the given integer to a string and appends it between the given prefix and suffix.
 *
 * @param buffer Output string buffer (must be large enough).
 * @param prefix Text to prepend (e.g., "T: ").
 * @param value Integer value to convert and insert.
 * @param suffix Text to append (e.g., "C").
 */
void formatString(char *buffer, const char *prefix, int value, const char *suffix)
{
    char *ptr = buffer;

    // Copy prefix
    while (*prefix)
        *ptr++ = *prefix++;

    // Convert integer value to string (manual itoa)
    char tempBuffer[10];
    char *tempPtr = tempBuffer + sizeof(tempBuffer) - 1;
    *tempPtr = '\0';

    int temp = value;
    do {
        *--tempPtr = (temp % BASE_DECIMAL) + '0';
        temp /= BASE_DECIMAL;
    } while (temp > 0);

    // Copy numeric string
    while (*tempPtr)
        *ptr++ = *tempPtr++;

    // Copy suffix
    while (*suffix)
        *ptr++ = *suffix++;

    *ptr = '\0';  // Null-terminate final string
}

/**
 * @brief Set or clear a pixel at (x, y) in the display buffer.
 *
 * The display is organized in pages, each page representing 8 vertical pixels.
 * This function modifies the appropriate bit in the display buffer.
 *
 * @param x X-coordinate (column).
 * @param y Y-coordinate (row).
 * @param on 1 to turn pixel on, 0 to turn it off.
 */
void setPixel(int x, int y, int on) {
    if (x < 0 || x >= DISPLAY_BUFFER_OFFSET || y < 0 || y >= Y_AXIS_HEIGHT) return;
    int page = y / (Y_AXIS_HEIGHT/2);
    int bit = y % (Y_AXIS_HEIGHT/2);
    if (on)
        ucDisplayBuffer[x + (page * DISPLAY_BUFFER_OFFSET)] |= (1 << bit);
    else
        ucDisplayBuffer[x + (page * DISPLAY_BUFFER_OFFSET)] &= ~(1 << bit);
}

/**
 * @brief Generates a 15-bit pseudo-random number using an internal seed (LCG).
 *
 * This function produces a pseudo-random number using a Linear Congruential Generator (LCG)
 * with a persistent internal seed. No external state is needed.
 *
 * @return A 15-bit pseudo-random integer in the range [0, 32767].
 *
 * @note This function is deterministic for the initial seed and produces the same sequence
 *       on each run unless the code is modified to seed it differently.
 */
int pseudorandom(void)
{
    static unsigned int seed = 6789;  // Internal persistent seed
    seed = seed * 1103515245 + 12345;
    return (seed >> 16) & 0x7FFF;
}

/**
 * @brief Converts a numeric string to an integer.
 *
 * This function parses a null-terminated string containing numeric characters ('0' to '9') 
 * and converts it into an integer value. If the string contains any non-numeric characters, 
 * the function returns an error code (-1).
 *
 * @param str Pointer to the null-terminated string representing a numeric value.
 * @return The converted integer value if the input is valid, or -1 if the string contains non-numeric characters.
 */
int stringToInt(const char *str) {
    int value = 0;
    while (*str) {
        if (*str < '0' || *str > '9') {
            return -1; // Error: non-valid character
        }
        value = value * 10 + (*str - '0');
        str++;
    }
    return value;
}

/**
 * @brief Formats and stores task statistics in a buffer.
 *
 * This function generates a formatted string containing details about a FreeRTOS task,
 * including its name, CPU usage percentage, available stack space, and current state.
 * The formatted output is stored in the provided buffer for further transmission or logging.
 *
 * @param buffer Pointer to a character array where the formatted statistics will be stored.
 * @param task Pointer to the TaskStatus_t structure containing information about the task.
 * @param totalRunTime Total runtime of all tasks, used to compute CPU usage percentage.
 */
void formatTaskStats(char *buffer, TaskStatus_t *task, uint32_t totalRunTime) {
    char temp[BUFFER_SIZE_TEMP];
    uint32_t cpu = 0;

    buffer[0] = '\0';  // Clear buffer

    strcat(buffer, "📌 Name: ");
    strcat(buffer, task->pcTaskName);

    strcat(buffer, " | CPU: ");

    if (totalRunTime > 0) {
        cpu = (task->ulRunTimeCounter * 100UL) / totalRunTime;
    }

    utoa(cpu, temp, BASE_DECIMAL);  // Convert number to string
    strcat(buffer, temp);

    strcat(buffer, "% | Stack Free: ");
    utoa(task->usStackHighWaterMark, temp, BASE_DECIMAL);
    strcat(buffer, temp);

    strcat(buffer, " | State: ");
    utoa(task->eCurrentState, temp, BASE_DECIMAL);
    strcat(buffer, temp);

    strcat(buffer, "\n");
}

/**
 * @brief Converts an unsigned integer to a string representation in the specified base.
 *
 * This function converts a given unsigned integer into a null-terminated string
 * using the specified numerical base (between 2 and 16). The conversion is done
 * in reverse order, and the result is stored in the provided buffer.
 *
 * @param value The unsigned integer to convert.
 * @param str Pointer to a character array where the converted string will be stored.
 * @param base Numerical base for conversion (valid range: 2 to 16).
 * @return Pointer to the resulting string buffer.
 */
char *utoa(unsigned int value, char *str, int base) {
    char *ptr = str;
    char *ptr1 = str;
    char tmp_char;
    unsigned int tmp_value;

    // Only valid bases
    if (base < 2 || base > 16) {
        // Invalid base, return empty string
        *str = '\0';
        return str;
    }

    // Convert number to string in reverse order.
    do {
        tmp_value = value;
        value /= base;
        *ptr++ = "0123456789ABCDEF"[tmp_value % base];
    } while (value);

    // End string
    *ptr-- = '\0';

    // Invert string (because we built it backwards)
    while (ptr1 < ptr) {
        tmp_char = *ptr;
        *ptr-- = *ptr1;
        *ptr1++ = tmp_char;
    }
    return str;
}
